{"podcast_details": {"podcast_title": "Stereo Chemistry", "episode_title": "C&EN Uncovered: Making hydrogen is easy; making it green is a challenge", "episode_image": "https://ssl-static.libsyn.com/p/assets/a/1/0/4/a104d5bbdaffe29d/StereoChem-Logo1400-converted.jpg", "episode_transcript": " Welcome to CNN Uncovered. I'm Gina Vitale. CNN Uncovered is a new podcast project from Stereochemistry. In each episode, we'll take another look at a recent cover story in chemical and engineering news and hear from CNN reporters about striking moments from their reporting, their biggest takeaways, and what got left on the cutting room floor. I'm filling in today for our usual host, Craig Bettenhausen, because today we will actually be talking about Craig's cover story. Hi, Craig. How does it feel to be on the other side of this? Hey, Gina. Yeah, so far so good. So in this episode, we are looking at Craig's cover story on engineering electrolyzers, which appeared in the July 3rd issue of CNN. So Craig, can you give us a quick overview of that story for any listeners who need a refresher? So electrolyzers, that's the actual equipment that's used to split water into hydrogen and oxygen. And there's a lot of interest in these right now because everyone wants to use green hydrogen, which means using renewable electricity to split water, as a way to decarbonize all kinds of different industries. And there's some interesting chemistry involved in making those cells more efficient. But the big thrust right now is in scaling up the manufacturing so that we can actually deliver enough of these units to make an impact. So what drove you to write about this in the first place? So one of my big areas that I cover a lot is bio-based fuels and chemicals. And as I went to some of these meetings, people talking about sustainable aviation fuel and renewable gasoline and renewable diesel, and the idea of making fuel or other plastics from captured carbon dioxide, over and over again in the process diagrams, they said, and here's where you put in the hydrogen. They're just hydrogenating things at every one of these processes, every step of the way. And so I started to wonder like, okay, where are we going to get all the hydrogen? Because especially if you're talking about carbon dioxide to fuels, these processes are only as green, they're only as sustainable as the hydrogen that you're using. So my understanding from your story was that basically, right now, there really is very little green hydrogen, but in the near future, we are going to need boatloads of it. And that's sort of the key issue at play. Is that right? Yeah. Yeah. That's the current thinking that there's a lot of things we could do with green hydrogen if we have it, but we don't actually make very much of it. Less than 1% of the hydrogen used today is green hydrogen. Most of the hydrogen we have is just made from fossil fuels. So electrolyzers are kind of like big devices where we actually split the water into hydrogen, right? So can you kind of describe those on a basic level, how they work, you know, for somebody like me who has not really looked at electrochemistry in a good amount of time? Well, I mean, there's a classic like high school chemistry demonstration where you take a battery and put it on a copper and usually a steel or silver electrode and put that into a jar of salty water. And when you hook up the battery, you're going to get one of them will bubble a lot and the other one bubble a little bit, and that's your hydrogen and your oxygen coming off. And these are all basically just more complicated industrialized versions of that. So people now as they're realizing that they really need to scale up the amount of electrolyzers that we have are in a position where they're, you know, having to decide which type of electrolyzer they're going to build, right? Yes. The two major technologies that are dominant now, one is the alkaline cell, which is called that because the water is very basic. It's a very high pH. And then the newer version is called proton exchange membranes and that's organized a little bit differently. And so instead of passing through the water, that charge is, you know, passing through this polymer membrane. And so those are the two basic, you know, approaches now. So you know, can you tell us more about how people are making that decision? Is there a front runner? I know you get into this pretty in depth in the story. Yeah. I mean, there's definitely a front runner right now, the alkaline systems. And we've been doing alkaline electrolysis for about 50, 60 years. And so that is definitely the leader because they already do have large scale manufacturing plants. And the balance tends to be that with an alkaline system, it's big, you're dealing with many gallons of caustic liquid, and you also need a lot of more supporting technology because the product gases from an alkaline cell are usually not at any kind of appreciable pressure. It's just like ambient pressure, whereas to put it in a pipeline, put it in a canister, you have to pressurize it. But on the flip side, the alkaline cells are at the moment cheaper mostly. Right. Whereas the proton exchange membranes, it comes right out of the cell pretty much ready to go into a canister or a pipeline. And it can also ramp up and down easier. Gotcha. But they're more expensive on a capital expenditure, like buying the unit. But all these things are changing very quickly because none of these things are at a real major scale. And of course, as you scale things up, they get cheaper. And that's what everyone's kind of banking on. Yeah. I wanted to ask about that because it seems like we are going from our current demand for green hydrogen to an absolutely massive demand for green hydrogen. And from your reporting, do you get a sense of whether we're actually going to be able to meet that demand? It just sounds almost insurmountable. It's going to require a big investment. But the way that I kind of think about it is a lot of this investment is being done by energy companies, oil companies, and chemical companies. And so it's a huge amount of capital outlay, but it's not out of the scale of what those industries spend on new equipment in a similar timeframe. They're going to have to up it a little bit if they want to meet those goals, but it's doable. The bigger crunch really is, as we've been saying, in the companies producing the cells, being able to build the manufacturing plants. Was there anything that you left out of the story that you thought was really interesting? Yeah. I talk about it a little bit, but when we talk about these hydrogen cells, we talk a lot about the hydrogen, obviously. But on the other side of the cell, you're making oxygen for all the systems we're talking about here. And it's really the oxygen evolution reaction that's the problem. Making hydrogen electrochemically is pretty simple, but you've got to balance the equation. And the oxygen evolution reaction is slow and sluggish. And so there's a lot of interesting work happening about people getting around that problem one way or the other. One that I read about a company called H2 Pro. And they said, okay, what if we weren't even making hydrogen and oxygen at the same time? They make the hydrogen and they charge up the anode. So it's got all this electrical charge on it, and then they turn it off and they switch it around and they change the conditions. And then it makes the oxygen. So they're separating it in time. Interesting. And that solves some problems about separating the gases, because obviously you don't want to mix your hydrogen and your oxygen and have that mixture just kind of sitting around, because all it takes is one little spark, even something like a cell phone ringing in a bad enough situation could ignite that. And then there's also some interesting work around, okay, why are we making oxygen at all? There's certainly industrial uses for oxygen, but mostly that's kind of a waste product or a side product. But there are other things we do need to oxidize. You need to do a lot of oxidation in a wastewater treatment plant. So could you make a hydrogen plant at a wastewater treatment plant and use the oxygen side to fry all the biological oxygen demand? Tell us a little bit more about how the government subsidies like the Inflation Reduction Act impact the area of green hydrogen electrolyzers. It's a big driving force. It's changing the game. So we've talked a lot in CNN about 45Q, which is part of the tax code. It's from the Inflation Reduction Act and some of the other packages, and that's the carbon capture credit. There's also 45V, and that's a clean hydrogen production tax credit. That's one of the easier ones for companies to take advantage of because they really get a refundable tax credit for every kilogram of hydrogen that has, in their case, below a certain carbon footprint. And it's generous. It's $3 per kilogram for clean hydrogen. And it doesn't have to be all the way to zero carbon to get that. And that's really driving a lot of investment because green hydrogen right now is, depending on your equipment, but might cost like $5 to $7 per kilogram. And your gray hydrogen is about a dollar a kilogram. So that gets really close to making a price parity. And for some of the applications where you have other reasons to want green hydrogen, it makes it just pay off. Just really quickly, because we've mentioned it a few times, could you kind of sum up what gray hydrogen is? Sure. Sure. So the existing way we get hydrogen, for the most part, is we take natural gas, which is really just a PR term for methane from fossil fuels. They got a really good name in there and it stuck. But you can take methane and you can convert it to hydrogen. Another major source is doing the same basic thing, but to coal that's been gasified. So they call that often like black hydrogen, but it's the same basic concept. You see the hydrogen rainbow, green hydrogen, blue hydrogen, gold hydrogen, white hydrogen. Really we want low carbon hydrogen. And so there's some other ways to do that. There's a group called Utility Global that I talked to. They're taking carbon monoxide, which is a waste product in steelmaking. And then they're using what's kind of a short circuit electrochemical cell. There's no electrical input, but it does go through a solid X oxide ceramic material. So they're going to react carbon monoxide with steam and get carbon dioxide and hydrogen as the outputs. It's the same overall chemical reaction as steam methane reforming, how we get most of the hydrogen today, except that they're getting pure hydrogen and pure carbon dioxide already pressurized, already captured. So a lot of the work in carbon capture is actually getting the carbon dioxide all by itself and the system does that. And then another one that I think had a lot of potential to really steal the prize is called BECCS hydrogen, which is bioenergy with carbon capture and storage. So there the idea is you're going to take some sort of biomass. It might be wood shavings or tree branches or corn stover and using some gasification or paralysis technology, extract the hydrogen from those hydrocarbons and take the carbon, which will probably be released as carbon dioxide and sequester that. So then you've got hydrogen, but not only is it low carbon, it's actually carbon negative. Interesting. A lot of different kinds of hydrogen. Yeah. What are you hoping to follow as this all develops? I mean, the big other side of this coin are these uses for green hydrogen because some of them pencil out right now and some of them would have to, the economics have to change a lot before they started to work. And that's always an interesting thing because one of the ones that makes the least sense economically sort of is the idea of CO2 to chemicals, like capturing carbon dioxide from direct air capture and then using this hydrogen. That's just a lot of expensive things all happening at once. But at the same time, there are people seriously pursuing it because they think that's where we need to get eventually, especially for things like jet fuel that are going to unavoidably have carbon emissions associated with it. And for some of the applications where you have other reasons to want green hydrogen, it makes it just pay off. I mean, forklifts, it sounds like a silly example, but because a forklift is in a warehouse, you don't really want to be transporting hydrogen, having a big hydrogen tank, you want to make it on site, fill your forklift, off it goes, turn everything off. It already works there. You can already do that. Interesting. And there's a project actually right near here in DC where buses and things like that, major transportation vehicles also start to make sense. All you have to transport is electricity and water. You don't have to transport explosive or flammable things. Interesting. Yeah, I was wondering about that, how that might translate into things that people use on a more everyday basis as opposed to things like forklifts, which are also important. And everyone's assuming that the personal transportation market, your cars, is all going to go battery. I'm actually not a hundred percent convinced of that because there's a big infrastructure problem around that and liquid fuels are great. It's a really good way to power something like that. Hydrogen-fueled cars, I'm not sure that's the right solution, but you can imagine a situation where all you need to refuel your car is an outlet and your hose, and that's pretty attractive. That's a lot easier than trying to bulk up the electrical infrastructure at that kind of scale. Cool. Thank you, Craig, for coming on the show today as a guest rather than a host. And tell us where people can find you on social media. Sure. Just about every social media platform, I'm at Craig of Waffles or LinkedIn, I'm just gonna write my regular name. And you can find me on Twitter as at Gina C. Vitali and probably everywhere else. Once again, you can find Craig's cover story about engineering electrolyzers on CNN's website or in the July 3rd print issue of CNN. We've put a link in the show notes along with the episode credits. And we'd love to know what you think of CNN Uncovered. You can share your feedback with us by emailing cenfeedbackatacs.org. This has been CNN Uncovered, a series from CNN's Stereochemistry. Stereochemistry is the official podcast of chemical and engineering news. CNN is an independent news outlet published by the American Chemical Society. Thanks for listening."}, "podcast_summary": "In this podcast, the host, Gina Vitale, discusses Craig Bettenhausen's cover story on engineering electrolyzers. Electrolyzers are used to split water into hydrogen and oxygen, and there is growing interest in using green hydrogen, produced from renewable electricity, to decarbonize various industries. The focus is on scaling up manufacturing to meet the increasing demand for green hydrogen. Craig was driven to write about this topic after realizing the need for hydrogen in various sustainable fuel and chemical production processes. Currently, less than 1% of hydrogen production is green, with the rest coming from fossil fuels. Different types of electrolyzers are being considered, namely alkaline cells and proton exchange membranes, with alkaline systems being the current front runner due to their established large-scale manufacturing. However, proton exchange membranes have advantages such as ease of integration and ramping up and down. Government subsidies like the Inflation Reduction Act, particularly the clean hydrogen production tax credit, are driving investment in green hydrogen electrolyzers. Carbon capture and utilization methods to produce low carbon and carbon-negative hydrogen are being explored. The podcast also touches on the potential use of green hydrogen in transportation, such as forklifts and buses. In conclusion, meeting the demand for green hydrogen will require significant investment, but it is feasible. The challenge lies in the manufacturing of electrolyzers and the associated infrastructure. To learn more, readers can find Craig's cover story on CNN's website or in the July 3rd print issue.", "podcast_guest": "An electrolyte is a medium containing ions that is electrically conducting through the movement of those ions, but not conducting electrons. This includes most soluble salts, acids, and bases dissolved in a polar solvent, such as water. Upon dissolving, the substance separates into cations and anions, which disperse uniformly throughout the solvent. Solid-state electrolytes also exist. In medicine and sometimes in chemistry, the term electrolyte refers to the substance that is dissolved.Electrically, such a solution is neutral. If an electric potential is applied to such a solution, the cations of the solution are drawn to the electrode that has an abundance of electrons, while the anions are drawn to the electrode that has a deficit of electrons. The movement of anions and cations in opposite directions within the solution amounts to a current. Some gases, such as hydrogen chloride (HCl), under conditions of high temperature or low pressure can also function as electrolytes. Electrolyte solutions can also result from the dissolution of some biological (e.g., DNA, polypeptides) or synthetic polymers (e.g., polystyrene sulfonate), termed \"polyelectrolytes\", which contain charged functional groups. A substance that dissociates into ions in solution or in the melt acquires the capacity to conduct electricity. Sodium, potassium, chloride, calcium, magnesium, and phosphate in a liquid phase are examples of electrolytes.\nIn medicine, electrolyte replacement is needed when a person has prolonged vomiting or diarrhea, and as a response to sweating due to strenuous athletic activity. Commercial electrolyte solutions are available, particularly for sick children (such as oral rehydration solution, Suero Oral, or Pedialyte) and athletes (sports drinks). Electrolyte monitoring is important in the treatment of anorexia and bulimia.\nIn science, electrolytes are one of the main components of electrochemical cells.In clinical medicine, mentions of electrolytes usually refer metonymically to the ions, and (especially) to their concentrations (in blood, serum, urine, or other fluids). Thus, mentions of electrolyte levels usually refer to the various ion concentrations, not to the fluid volumes.\n\n", "podcast_highlights": "- Electrolyzers are used to split water into hydrogen and oxygen for the production of green hydrogen.\n- Currently, less than 1% of hydrogen used today is green hydrogen, with the majority being produced from fossil fuels.\n- The two major electrolyzer technologies are alkaline cells and proton exchange membranes, with alkaline systems being the current frontrunners due to their large-scale manufacturing capabilities."}