{"podcast_details": {"podcast_title": "Crawling Mondays by Aleyda - SEO News, Tips and Interviews", "episode_title": "Optimize your Website Content for Multilingual Markets", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded/5507820/5507820-1589530490491-0e945ed69eee7.jpg", "episode_transcript": " Welcome to a new edition of Carly Mondays. In today's edition, we are going to talk about international content optimization or multilingual content optimization. A lot of people think that whenever they start doing international SEO is about extra plan, technical configurations, and pretty much a lot of attention goes there. But without content, there's literally nothing else. So I will say it should be the first step that you should be caring about. Whenever you do international SEO, how you can optimize your content to be aligned and connect with the search behavior of your different multilingual, multi-country markets. And to speak about this topic, I have invited today a couple of SEOs who have a wealth of experience in multilingual content optimization for SEO processes. On one hand, I have Sara Fernandez, who's the SEO strategist at eDreams. Hello, Sara. How are you? Hello, I'm good. Thanks. Thank you for inviting me. Aleda, how are you? So, so great to have you here. Thank you for coming. And on the other hand, I have Natalia Butzik. Natalia is an international SEO consultant with experience in multilingual content optimization. Hello, Natalia. How are you? Hi, hello. I'm very well. Thanks. Thanks for having me. I'm delighted to have you here too. And before starting our today's conversation, I want to thank Content King. Content King is that SEO alerting tool that will pretty much monitor whatever configuration or content of your website. So you will be warned not only when your canonical tags or your extra blank annotations are changed, but when your title tags, all of the sudden, rather than being featured in Spanish or German or in French or in the relevant language, they should be, all of a sudden they are replaced with the English ones for some reason, right? So take a look at Content King. Do you have a link below here? And now we are ready to start our today's episode. Why is multilingual content optimization so fundamental, so critical, even if we are already targeting countries speaking the same languages. I think it's so critical because if we really want to be a multilingual company that targets many countries, we have to treat every single market we're targeting as a separate client almost. So it's like a separate process of separate reporting, separate analysis, separate keyword research, everything separate. And I think as soon as we make that switch in our head, then the whole rest of the process is crystal clear. There's a new approach every time, but I think if someone's never done that switch in their head, they don't understand that it's not a website. It's actually multiple elements to look at separately. Yeah, absolutely. And also we need to target markets separately because we cannot use a rinse and repeat approach because the same message doesn't necessarily need to resonate with just any audience. So we need to tailor that content to each market. We need to make sure that we understand the culture, that we use the right terms. We cannot just, so take a keyword research with it for the U S market and reuse it with the UK market. There are so many aspects like, not necessarily speaking of keywords, but units of measure, currency, so many things that we have to adapt when starting our strategy with the new market. So yeah, we need to prioritize localization and cultural awareness to create meaningful experiences with that target market. It's going to sound artificial. It's not going to connect with the user. You have mentioned a couple of criteria that for me are fundamental here. First, that is not necessarily only purely about SEO, right? That is about marketing at the end of the day and the messaging and not alienating and instead engaging and converting, because at the end of the day is about the user trusting you and buying from you. And even if you can't get away with a generic message in the language, they won't trust you. They won't engage with you necessarily. And they won't end up converting with you because of this. It is fundamental to show that you understand them, that you care about them and that you're tailoring your overall presence for them. Also, there's another point here that is about seeing a lot of it as a waste or repetitive task for every single market, because we were mentioning before how we should consider each market like an independent process at the end of the day. So I can imagine, I know that some businesses will say, oh, yeah, again, the same thing, but we can assume that, especially depending also a little bit of the business model, right? If you are, for example, a car rental company or a travel company, you know that the destinations and the locations, the queries will change a lot depending on on the location, but then the other businesses like the tech, for example, a tech blogs, like the terms are always mostly similar. Like why should I or SAS, why should I change again or validate again? Oh, you should do it even just to confirm that the terms and the behavior is so similar that it doesn't compensate to target countries rather than languages, right? To confirm the approach. But if you don't do it, you might be assuming too much and you might end up approaching certain markets in a way that is not the relevant one is not best one to really connect with that market and to engage with that market. And we'll end up also being overrun by many other competitors that do this. Well, let's talk about the top mistakes you see people doing when localizing their content, when optimizing their content for international markets. So some of the mistakes, very obvious, is to assume that the terms means exactly the same across different countries or only taking search volume as a criteria to optimize content. Which other mistakes you will say you see around many, many, many times. I think that very related to what you were just mentioning now, Aleda, I noticed that many times when it comes to Spanish, there are actually translation agencies, big translation agencies that offer this service that is translations from English to international Spanish. So this international Spanish is like some kind of standardized version of Spanish, which is not natural. And yeah, so many times companies which may not be culturally aware of the differences because they may not be Spanish speakers, they may say, oh, okay. I prefer this solution because it's cheaper and I can just use this translation for Spain, for Mexico, for Argentina. But as we know, this is not natural. This doesn't resemble like the language that any Spanish native speaker would speak because it's just like a mixture, like a mix of different variants. This is how you make sure that everybody feels alienated at the end of the day and nobody trusts you, not even a single one. And sometimes it's true that some companies go one step further. They try a little bit harder and they say, okay, so we're going to do Spanish from Spain and Spanish from Mexico for all Latin America. And as you were mentioning, Aleda, like Mexico, for example, they don't use VOS and yeah, Nicaragua and Argentina may both use VOS, but surely there'll be words that will change between those countries as well. I have totally agree with what has been just said. I think the mistake maybe it's that I don't see that often, but when I see it, it's such a big one. I have to mention it. When people see the volume and the search volume is huge and they don't realize it's a meme or a song or something that has nothing to do with the keyword. And as you know, with internet culture, with pop culture, making a song about any single thing, even an industrial term can have a specific peak because there's another word that it's been paired with and it has nothing to do with the original meaning. So I feel like sometimes it can be a huge mistake to just go for the volume and not actually Google things and not realize why the importance of the keywords is there. The context is so critical and this is why we should always take a double look at the SERPs. Take a look at which type of content, what is the nature of the content actually ranking? Exactly. I can think of an example. If you, for example, work in travel and you see that suddenly you're getting a lot of impressions for like destinations, let's say, for example, Valencia, Sevilla, like over the weekend, you see like a spike, but nobody's really entering on your website, which may be in the travel industry. This may be because football teams, Valencia and Sevilla actually played a football match and people were actually searching for the results of that match. So obviously they were not looking for a vacation and that's why they were not interested on your website. So yeah, so important to take into account just anything that could be happening in that country as well in that moment. Something that you also mentioned before, of course, we need to take this a little bit with a grain of salt and balance the team involved in content localization. It will be ideal to have someone who's a professional translator, but also who's also a native speaker of the country that is also a subject matter expert in that particular field of the one of the website. Why I am saying this in the first place, because some time ago I had a client that was in the marketing automation space and they had hired this translation agency with a proper translator from English to Spanish to take the content that already existed into Spanish and translated the content in a way that was grammatically correct. But a marketer, Spanish speaker marketer will never search like that. Automatización de marketing, for example. No, we search with the term in English marketing automation. And yes, that is the grammatically correct term, but please, at least at the one in English, also known as and the one in English, because a lot of people in Spanish speaking countries will also use the term in English. Also, I remember one that was very funny as an SEO myself, like building. How do you say this in Spanish? It cannot be the term in English. Need to be creación de laces. I was like, no, nobody call it like this. So this is why it is important that although, yes, we want translators who are professionals, that we also bring someone who's a subject matter expert that know about the topic so they can also blend their expertise and the way that people also search about that particular topic. I completely agree with this. And I think whatever used to be the issue with translators, maybe not being the subject matter expert, as you will say, Alina, I think we might be dealing with something similar in the future with chat GPT and people using one language as the reference and then maybe not being the subject matter expert. But I feel like in the international, it is very likely that there will be global, let's say headquarters team managing marketing that might have the urge to take whatever they did really in a good process in one country and try to spread it to all the countries. And that would be so risky. And exactly that part of the cultural empathy, it is just not there. What will this change? I think it will be a huge change. I think it will be a huge change. I think it will be a huge change. I think it will be a huge change. I think it will be a huge change. I think it will be a huge change. What will you say are the basic steps that you tend to follow and the tools that you use to facilitate a little bit the activities of each one of these steps? When it comes to tools, I would say that when working with translators and content writers, it's very important to have some translational management systems in place tools like localized. For example, it's like a centralized platform where you can manage translation projects. and you can collaborate with translators and different contributors, and you have everything centralized. And also not exactly a tool, but it's important to have a style guide and a glossary in place, which of course can be modified within time. Also to avoid this back and forth with translators. So if you tell them, for example, supply chain, I don't want it to be translated by Cadena y Suminstro. Please keep it as supply chain for Spain and maybe for Mexico, like separate for each market inside the same language. You have different style guides and glossaries. This is going to make the process way faster and you'll avoid a lot of emails and back and forth. I have to add to that. That is why I think that the keyword research process is so valuable. And the first step to start with, even if there's already content and in the language for a different market should always be there. I definitely agree with the keyword research being the backbone of every first steps. I mean, it has to be there even if it's been done. And until recently, I used to take inspiration for all the ready keyword research and all the keyword researchers I could understand in any language I speak. But recently I started something new and it's keyword research without any impact of anything in other languages. So completely separating everything that's been done for any other market and just doing it from scratch for the market I'm currently working on. And I found it to be very, very innovative because you automatically, even if you've only seen another keyword research once, you would try to translate it in your head, even if you adapt it locally. But I think if you start from scratch and literally go from the beginning of the process in just one language, it really can get you further. And I think kind of doesn't block you from creativity in there. And as it comes to tools, I'm lucky to have the lifetime license for answer to the public, so I keep coming back to it and I think clients like the design of the deliverables. So it's like a familiar kind of way of showing some content ideas, for example. But I have to say that also asked is becoming my more favorite one recently. I think specifically because it gets a lot of work done on how to improve the tool and I can see every time it's just better and better. Yeah, it's amazing, right? How nowadays I will say that most keyword research and content optimization tools are by default multilingual. They support multi-country and multi-languages, which was not like that back in the day when I was starting, right? So we have tools like Semroth that by default, like since forever they have supported many different languages and countries, but now also other newer tools like keyword insights, for example, that can highly, highly support the next stage, let's say of the keyword research, keyword mapping, developing topic clusters, et cetera, and then content optimization tools like Surfer or... Yeah, actually it's very ugly of me not to mention the tool from my country. That's taking over the world. It's true. It's true, isn't it? Surfer and Phrase are this combo content tools that are particularly useful when doing multilingual content optimization too. Any other tools that you'd like to use? I would add Thru to the list. So Thru with three U's, I'm a server analyzer and it's really good. Like it scrapes the top ranking pages for a specific keyword and data-in-delivery, I use it quite a lot. It also provides content briefs. It's great. So individual or specific keyword research for each one of the markets, the same way, well, keyword mapping, content optimization, collaboration with the translators or copywriters, one or the other should be there. And it's important that these are native, not automated translators. I have to say that I am a little bit lazy myself. And nowadays, whenever I am writing something in English and I need to translate it to Spanish, I go and use, for example, DeepL is such a powerful and good translator. So I first run DeepL and then I start editing, but there's never a time in which I don't need to edit something. So it shows the importance that even if they have a lot, they are definitely much better than before. There's a need to have a native speaker there at least validating and editing something into their native language. What is your last tip to wrap up today's edition of this one thing that we haven't yet covered, but that you think that is important, critical to take into account when doing multi-lingual content optimization? A last advice to our audience. I would say, I think SEO doesn't do miracles. So it is really about what we mentioned in the very beginning of it, a business model of a company and how international it is. So I think if you can take something international and actually show it to the world, the job is to be done because you have a product that is being sold and wanted throughout the world. So probably it's not just about SEO success. It's actually about the company success and company culture in many ways. And that's kind of to maybe one consultant like myself. I work for myself and sometimes I would love to make a company more international than it really is just by my SEO work, but it's not just up to me. It's bigger, but it's also when SEO can help with the buy-in and making the company more international by pushing some processes throughout. So maybe just think about the company as a company that's multinational and then SEO is an extension of that. I love that advice. Speaking of which, like I will say that I see a lot of companies, especially startups, when they think about, oh, I want to go international, like multi-country content. But yeah, make it happen. And then they don't realize that that means that they will actually end up having customers from these countries that they will need to support. So they need to have someone at an ongoing basis, to give support for these customers. Because yes, it goes beyond just SEO for sure. So I would say, especially when working in-house, just because it's probably going to be easier, but have access to any user research data that could be available in the company. So information that could be delivered by UX teams, but also sales teams, basically your colleagues that are in touch with that market, any kind of surveys and questionnaires, user interviews, user testing, any kind of user behavior data, ask them for this information, because it's going to be very insightful and it's going to help you also understand that market much better. And it's important to keep communication open with these teams as well. That's really good advice, especially when you work at an in-house enterprise level company, you have a wealth of information already there in my case. I will say like what you mentioned before, Natalia, about some companies, especially when you're a consultant and seeing this a little bit from the outside, but also when they are also starting to target these markets, this meme that is about a guy going on a bike and then taking like a pen or something like that, put it in the wheel and it's himself generating the challenge. Right? I feel that many companies, I'm afraid, they do it. By default, whenever they start, even if you're a startup and you are just establishing your web structure right now. And it's true that potentially at this time, you're only thinking about targeting one language or one country. Think about three years, think about five years. It's so straightforward and it will require the same effort to establish a web structure that is scalable and can grow easily in different languages and in different markets. So for example, rather than just selecting a CTLD for your own country, go for a GTLD, your name, you might want to choose a name that can be pronounced and easily type in different languages, or that doesn't mean something crazy in a different language too. So yeah, localization and optimization for different markets start from the base. When you establish your web presence, your website with this little decisions that might seem trivial, but again, it takes the same effort to do it well and scale easily later on than to do it badly and having to develop your website again or rebrand. So thank you, thank you very much, Sara and Natalia for your input, for your ideas. I hope that this has been valuable for the audience. And if you have any questions, if you have any doubts, please ask Natalia, ask Sara. They are pretty active over social. They have their handles here. You can ask me too. We are active over Twitter and also LinkedIn. Let's see if Twitter continues to exist when this goes live or even in YouTube. You can leave a comment too, or whatever podcast platform you're using for this. Thank you very much for listening. Like the video if you like it, if it was useful, subscribe to the channel again. And remember to subscribe to SEOFOMO to keep up with the latest SEO news. So you never miss an episode like this or any other international SEO type of resources that I will tend to feature. Thank you, thank you very much, Natalia and Sara. It was a pleasure to speak with you today. Have a great day."}, "podcast_summary": "In this podcast, the topic of international content optimization or multilingual content optimization is discussed. The importance of optimizing content for different multilingual markets is highlighted. The guests on the podcast include Sara Fernandez, the SEO strategist at eDreams, and Natalia Butzik, an international SEO consultant. They discuss the need to treat each market as a separate entity and not assume that the same content will resonate with all audiences. They emphasize the importance of tailoring content to each market and understanding the culture and language of the target audience. The guests also mention some common mistakes in international content localization, including assuming that terms have the same meaning in different countries and relying solely on search volume for content optimization. They provide insights into their workflow and mention tools such as Content King, localized, keyword insights, Surfer, Phrase, and Thru with three U's that can facilitate multilingual content optimization. The importance of involving native speakers and subject matter experts in the content localization process is emphasized. The guests also stress the need for companies to think internationally and consider the entire customer experience beyond just SEO. They recommend having access to user research data and maintaining open communication with teams involved in marketing and user experience. The podcast concludes with the advice to establish a scalable web structure from the beginning that can easily support content localization for different languages and markets.", "podcast_guest": "Search engine optimization (SEO) is the process of improving the quality and quantity of website traffic to a website or a web page from search engines. SEO targets unpaid traffic (known as \"natural\" or \"organic\" results) rather than direct traffic or paid traffic. Unpaid traffic may originate from different kinds of searches, including image search, video search, academic search, news search, and industry-specific vertical search engines. \nAs an Internet marketing strategy, SEO considers how search engines work, the computer-programmed algorithms that dictate search engine behavior, what people search for, the actual search terms or keywords typed into search engines, and which search engines are preferred by their targeted audience. SEO is performed because a website will receive more visitors from a search engine when websites rank higher on the search engine results page (SERP). These visitors can then potentially be converted into customers.", "podcast_highlights": "- Multilingual content optimization is crucial for international SEO\n- Each market should be treated as a separate client, with separate reporting and analysis\n- Localization and cultural awareness are key to create meaningful experiences with target markets"}